Dmivaka/STM32-HAL-BHI360/bosch/bhy2_defs.h
/**
* Copyright (c) 2023 Bosch Sensortec GmbH. All rights reserved.
*
* BSD-3-Clause
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1. Redistributions of source code must retain the above copyright
*    notice, this list of conditions and the following disclaimer.
*
* 2. Redistributions in binary form must reproduce the above copyright
*    notice, this list of conditions and the following disclaimer in the
*    documentation and/or other materials provided with the distribution.
*
* 3. Neither the name of the copyright holder nor the names of its
*    contributors may be used to endorse or promote products derived from
*    this software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
* "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
* LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
* FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
* COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
* (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
* SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
* HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
* STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
* IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
* @file       bhy2_defs.h
* @date       2023-03-24
* @version    v1.6.0
*
*/

#ifndef __BHY2_DEFS_H__
#define __BHY2_DEFS_H__

/* Start of CPP Guard */
#ifdef __cplusplus
extern "C" {
#endif /*__cplusplus */

#ifdef __KERNEL__
#include <linux/string.h>
#include <linux/slab.h>
#include <linux/types.h>
#else
#include <string.h>
#include <stdint.h>
#endif /*~ __KERNEL__ */

#ifndef UNUSED
#define UNUSED(__x__)                             ((void)(__x__))
#endif /*~ UNUSED */

#ifdef __KERNEL__
#define bhy2_float                                u32
#else
#define bhy2_float                                float
#endif /*~ __KERNEL__ */

#ifdef __KERNEL__

#if !defined(UINT8_C) && !defined(INT8_C)
#define INT8_C(x)                                 S8_C(x)
#define UINT8_C(x)                                U8_C(x)
#endif

#if !defined(UINT16_C) && !defined(INT16_C)
#define INT16_C(x)                                S16_C(x)
#define UINT16_C(x)                               U16_C(x)
#endif

#if !defined(INT32_C) && !defined(UINT32_C)
#define INT32_C(x)                                S32_C(x)
#define UINT32_C(x)                               U32_C(x)
#endif

#if !defined(INT64_C) && !defined(UINT64_C)
#define INT64_C(x)                                S64_C(x)
#define UINT64_C(x)                               U64_C(x)
#endif

#else /* __KERNEL__ */

#if !defined(UINT8_C) && !defined(INT8_C)
#define INT8_C(x)                                 (x)
#define UINT8_C(x)                                (x##U)
#endif

#if !defined(UINT16_C) && !defined(INT16_C)
#define INT16_C(x)                                (x)
#define UINT16_C(x)                               (x##U)
#endif

#if !defined(INT32_C) && !defined(UINT32_C)
#define INT32_C(x)                                (x)
#define UINT32_C(x)                               (x##U)
#endif

#if !defined(INT64_C) && !defined(UINT64_C)
#define INT64_C(x)                                (x##LL)
#define UINT64_C(x)                               (x##ULL)
#endif

#endif /* __KERNEL__ */

#ifndef NULL
#ifdef __cplusplus
#define NULL                                      0
#else
#define NULL                                      ((void *) 0)
#endif
#endif

#ifndef BHY2_PACKED
#define BHY2_PACKED                               __attribute__ ((__packed__))
#endif

/** API error codes */
#define BHY2_OK                                   INT8_C(0)
#define BHY2_E_NULL_PTR                           INT8_C(-1)
#define BHY2_E_INVALID_PARAM                      INT8_C(-2)
#define BHY2_E_IO                                 INT8_C(-3)
#define BHY2_E_MAGIC                              INT8_C(-4)
#define BHY2_E_TIMEOUT                            INT8_C(-5)
#define BHY2_E_BUFFER                             INT8_C(-6)
#define BHY2_E_INVALID_FIFO_TYPE                  INT8_C(-7)
#define BHY2_E_INVALID_EVENT_SIZE                 INT8_C(-8)
#define BHY2_E_PARAM_NOT_SET                      INT8_C(-9)
#define BHy2_E_INSUFFICIENT_MAX_SIMUL_SENSORS     INT8_C(-10)

#ifndef BHY2_COMMAND_PACKET_LEN
#define BHY2_COMMAND_PACKET_LEN                   UINT16_C(256)
#endif

#ifndef BHY2_COMMAND_HEADER_LEN
#define BHY2_COMMAND_HEADER_LEN                   UINT16_C(4)
#endif

#if (BHY2_COMMAND_PACKET_LEN < BHY2_COMMAND_HEADER_LEN)
#error "BHY2_COMMAND_PACKET_LEN should be at least 4 bytes"
#endif

#define BHY2_PRODUCT_ID                           UINT8_C(0x89)

/*! Register map */
#define BHY2_REG_CHAN_CMD                         UINT8_C(0x00)
#define BHY2_REG_CHAN_FIFO_W                      UINT8_C(0x01)
#define BHY2_REG_CHAN_FIFO_NW                     UINT8_C(0x02)
#define BHY2_REG_CHAN_STATUS                      UINT8_C(0x03)
#define BHY2_REG_CHIP_CTRL                        UINT8_C(0x05)
#define BHY2_REG_HOST_INTERFACE_CTRL              UINT8_C(0x06)
#define BHY2_REG_HOST_INTERRUPT_CTRL              UINT8_C(0x07)
#define BHY2_REG_RESET_REQ                        UINT8_C(0x14)
#define BHY2_REG_TIME_EV_REQ                      UINT8_C(0x15)
#define BHY2_REG_HOST_CTRL                        UINT8_C(0x16)
#define BHY2_REG_HOST_STATUS                      UINT8_C(0x17)
#define BHY2_REG_CRC_0                            UINT8_C(0x18) /* Totally 4 */
#define BHY2_REG_PRODUCT_ID                       UINT8_C(0x1C)
#define BHY2_REG_REVISION_ID                      UINT8_C(0x1D)
#define BHY2_REG_ROM_VERSION_0                    UINT8_C(0x1E) /* Totally 2 */
#define BHY2_REG_KERNEL_VERSION_0                 UINT8_C(0x20) /* Totally 2 */
#define BHY2_REG_USER_VERSION_0                   UINT8_C(0x22) /* Totally 2 */
#define BHY2_REG_FEATURE_STATUS                   UINT8_C(0x24)
#define BHY2_REG_BOOT_STATUS                      UINT8_C(0x25)
#define BHY2_REG_HOST_INTR_TIME_0                 UINT8_C(0x26) /* Totally 5 */
#define BHY2_REG_CHIP_ID                          UINT8_C(0x2B)
#define BHY2_REG_INT_STATUS                       UINT8_C(0x2D)
#define BHY2_REG_ERROR_VALUE                      UINT8_C(0x2E)
#define BHY2_REG_ERROR_AUX                        UINT8_C(0x2F)
#define BHY2_REG_DEBUG_VALUE                      UINT8_C(0x30)
#define BHY2_REG_DEBUG_STATE                      UINT8_C(0x31)
#define BHY2_REG_GP_5                             UINT8_C(0x32)
#define BHY2_REG_GP_6                             UINT8_C(0x36)
#define BHY2_REG_GP_7                             UINT8_C(0x3A)

/*! Command packets */
#define BHY2_CMD_REQ_POST_MORTEM_DATA             UINT16_C(0x0001)
#define BHY2_CMD_UPLOAD_TO_PROGRAM_RAM            UINT16_C(0x0002)
#define BHY2_CMD_BOOT_PROGRAM_RAM                 UINT16_C(0x0003)
#define BHY2_CMD_ERASE_FLASH                      UINT16_C(0x0004)
#define BHY2_CMD_WRITE_FLASH                      UINT16_C(0x0005)
#define BHY2_CMD_BOOT_FLASH                       UINT16_C(0x0006)
#define BHY2_CMD_SET_INJECT_MODE                  UINT16_C(0x0007)
#define BHY2_CMD_INJECT_DATA                      UINT16_C(0x0008)
#define BHY2_CMD_FIFO_FLUSH                       UINT16_C(0x0009)
#define BHY2_CMD_SW_PASSTHROUGH                   UINT16_C(0x000A)
#define BHY2_CMD_REQ_SELF_TEST                    UINT16_C(0x000B)
#define BHY2_CMD_REQ_FOC                          UINT16_C(0x000C)
#define BHY2_CMD_CONFIG_SENSOR                    UINT16_C(0x000D)
#define BHY2_CMD_CHANGE_RANGE                     UINT16_C(0x000E)
#define BHY2_CMD_FIFO_FORMAT_CTRL                 UINT16_C(0x0015)

/*! Soft passthrough feature */
#define BHY2_SPASS_READ                           UINT8_C(0)
#define BHY2_SPASS_WRITE                          UINT8_C(1)
#define BHY2_SPASS_SINGLE_TRANS                   UINT8_C(0)
#define BHY2_SPASS_MULTI_TRANS                    UINT8_C(1)
#define BHY2_SPASS_DELAY_DIS                      UINT8_C(0)
#define BHY2_SPASS_DELAY_EN                       UINT8_C(1)
#define BHY2_SPASS_SIF1                           UINT8_C(1)
#define BHY2_SPASS_SIF2                           UINT8_C(2)
#define BHY2_SPASS_SIF3                           UINT8_C(3)
#define BHY2_SPASS_SPI_4_WIRE                     UINT8_C(0)
#define BHY2_SPASS_SPI_3_WIRE                     UINT8_C(1)
#define BHY2_SPASS_SPI_CPOL_0                     UINT8_C(0)
#define BHY2_SPASS_SPI_CPOL_1                     UINT8_C(1)
#define BHY2_SPASS_SPI_CPHA_0                     UINT8_C(0)
#define BHY2_SPASS_SPI_CPHA_1                     UINT8_C(1)
#define BHY2_SPASS_SPI_CS_LOW                     UINT8_C(0)
#define BHY2_SPASS_SPI_CS_HIGH                    UINT8_C(1)
#define BHY2_SPASS_SPI_LSB_FIRST_DIS              UINT8_C(0)
#define BHY2_SPASS_SPI_LSB_FIRST_EN               UINT8_C(1)
#define BHY2_SPASS_SPI_READ_BIT_POL_LOW           UINT8_C(0)
#define BHY2_SPASS_SPI_READ_BIT_POL_HIGH          UINT8_C(1)
#define BHY2_SPASS_SPI_READ_BIT_POS_0             UINT8_C(0)
#define BHY2_SPASS_SPI_READ_BIT_POS_1             UINT8_C(1)
#define BHY2_SPASS_SPI_READ_BIT_POS_2             UINT8_C(2)
#define BHY2_SPASS_SPI_READ_BIT_POS_3             UINT8_C(3)
#define BHY2_SPASS_SPI_READ_BIT_POS_4             UINT8_C(4)
#define BHY2_SPASS_SPI_READ_BIT_POS_5             UINT8_C(5)
#define BHY2_SPASS_SPI_READ_BIT_POS_6             UINT8_C(6)
#define BHY2_SPASS_SPI_READ_BIT_POS_7             UINT8_C(7)
#define BHY2_SPASS_READ_PACKET_LEN                UINT8_C(0x13)
#define BHY2_SPASS_WRITE_RESP_PACKET_LEN          UINT8_C(16)

