Dmivaka/STM32-HAL-BHI360/bosch/bhy2_defs.h
#define BHY2_QUERY_PARAM_STATUS_READY_MAX_RETRY   UINT16_C(1000)
#define BHY2_QUERY_FLASH_MAX_RETRY                UINT16_C(1200)

/*! Meta event definitions */
#define BHY2_META_EVENT_FLUSH_COMPLETE            (1)
#define BHY2_META_EVENT_SAMPLE_RATE_CHANGED       (2)
#define BHY2_META_EVENT_POWER_MODE_CHANGED        (3)
#define BHY2_META_EVENT_ALGORITHM_EVENTS          (5)
#define BHY2_META_EVENT_SENSOR_STATUS             (6)
#define BHY2_META_EVENT_BSX_DO_STEPS_MAIN         (7)
#define BHY2_META_EVENT_BSX_DO_STEPS_CALIB        (8)
#define BHY2_META_EVENT_BSX_GET_OUTPUT_SIGNAL     (9)
#define BHY2_META_EVENT_RESERVED1                 (10)
#define BHY2_META_EVENT_SENSOR_ERROR              (11)
#define BHY2_META_EVENT_FIFO_OVERFLOW             (12)
#define BHY2_META_EVENT_DYNAMIC_RANGE_CHANGED     (13)
#define BHY2_META_EVENT_FIFO_WATERMARK            (14)
#define BHY2_META_EVENT_RESERVED2                 (15)
#define BHY2_META_EVENT_INITIALIZED               (16)
#define BHY2_META_TRANSFER_CAUSE                  (17)
#define BHY2_META_EVENT_SENSOR_FRAMEWORK          (18)
#define BHY2_META_EVENT_RESET                     (19)
#define BHY2_META_EVENT_SPACER                    (20)

/* Flash start address in memory */
#define BHY2_FLASH_SECTOR_START_ADDR              UINT32_C(0x1F84)
#define BHY2_FLASH_BULK_ERASE                     UINT32_C(0xFFFFFFFF)

/* End address for common flash sizes */
#define BHY2_FLASH_SIZE_0_5MB                     UINT32_C(0x7FFFF)
#define BHY2_FLASH_SIZE_1MB                       UINT32_C(0xFFFFF)
#define BHY2_FLASH_SIZE_2MB                       UINT32_C(0x1FFFFF)
#define BHY2_FLASH_SIZE_4MB                       UINT32_C(0x3FFFFF)
#define BHY2_FLASH_SIZE_8MB                       UINT32_C(0x7FFFFF)

/* Sensor IDs */
#define BHY2_SENSOR_ID_CUSTOM_START               UINT8_C(160)
#define BHY2_SENSOR_ID_CUSTOM_END                 UINT8_C(191)

#define BHY2_SENSOR_ID_MAX                        UINT8_C(200)
#define BHY2_SENSOR_ID_TBD                        UINT8_C(BHY2_SENSOR_ID_MAX - 1)

/* Virtual Sensor IDs */
#define BHY2_SENSOR_ID_ACC_PASS                   UINT8_C(1) /* Accelerometer passthrough */
#define BHY2_SENSOR_ID_ACC_RAW                    UINT8_C(3) /* Accelerometer uncalibrated */
#define BHY2_SENSOR_ID_ACC                        UINT8_C(4) /* Accelerometer corrected */
#define BHY2_SENSOR_ID_ACC_BIAS                   UINT8_C(5) /* Accelerometer offset */
#define BHY2_SENSOR_ID_ACC_WU                     UINT8_C(6) /* Accelerometer corrected wake up */
#define BHY2_SENSOR_ID_ACC_RAW_WU                 UINT8_C(7) /* Accelerometer uncalibrated wake up */
#define BHY2_SENSOR_ID_SI_ACCEL                   UINT8_C(8) /* Virtual Sensor ID for Accelerometer */
#define BHY2_SENSOR_ID_GYRO_PASS                  UINT8_C(10) /* Gyroscope passthrough */
#define BHY2_SENSOR_ID_GYRO_RAW                   UINT8_C(12) /* Gyroscope uncalibrated */
#define BHY2_SENSOR_ID_GYRO                       UINT8_C(13) /* Gyroscope corrected */
#define BHY2_SENSOR_ID_GYRO_BIAS                  UINT8_C(14) /* Gyroscope offset */
#define BHY2_SENSOR_ID_GYRO_WU                    UINT8_C(15) /* Gyroscope wake up */
#define BHY2_SENSOR_ID_GYRO_RAW_WU                UINT8_C(16) /* Gyroscope uncalibrated wake up */
#define BHY2_SENSOR_ID_SI_GYROS                   UINT8_C(17) /* Virtual Sensor ID for Gyroscope */
#define BHY2_SENSOR_ID_MAG_PASS                   UINT8_C(19) /* Magnetometer passthrough */
#define BHY2_SENSOR_ID_MAG_RAW                    UINT8_C(21) /* Magnetometer uncalibrated */
#define BHY2_SENSOR_ID_MAG                        UINT8_C(22) /* Magnetometer corrected */
#define BHY2_SENSOR_ID_MAG_BIAS                   UINT8_C(23) /* Magnetometer offset */
#define BHY2_SENSOR_ID_MAG_WU                     UINT8_C(24) /* Magnetometer wake up */
#define BHY2_SENSOR_ID_MAG_RAW_WU                 UINT8_C(25) /* Magnetometer uncalibrated wake up */
#define BHY2_SENSOR_ID_GRA                        UINT8_C(28) /* Gravity vector */
#define BHY2_SENSOR_ID_GRA_WU                     UINT8_C(29) /* Gravity vector wake up */
#define BHY2_SENSOR_ID_LACC                       UINT8_C(31) /* Linear acceleration */
#define BHY2_SENSOR_ID_LACC_WU                    UINT8_C(32) /* Linear acceleration wake up */
#define BHY2_SENSOR_ID_RV                         UINT8_C(34) /* Rotation vector */
#define BHY2_SENSOR_ID_RV_WU                      UINT8_C(35) /* Rotation vector wake up */
#define BHY2_SENSOR_ID_GAMERV                     UINT8_C(37) /* Game rotation vector */
#define BHY2_SENSOR_ID_GAMERV_WU                  UINT8_C(38) /* Game rotation vector wake up */
#define BHY2_SENSOR_ID_GEORV                      UINT8_C(40) /* Geo-magnetic rotation vector */
#define BHY2_SENSOR_ID_GEORV_WU                   UINT8_C(41) /* Geo-magnetic rotation vector wake up */
#define BHY2_SENSOR_ID_ORI                        UINT8_C(43) /* Orientation */
#define BHY2_SENSOR_ID_ORI_WU                     UINT8_C(44) /* Orientation wake up */
#define BHY2_SENSOR_ID_TILT_DETECTOR              UINT8_C(48) /* Tilt detector */
#define BHY2_SENSOR_ID_STD                        UINT8_C(50) /* Step detector */
#define BHY2_SENSOR_ID_STC                        UINT8_C(52) /* Step counter */
#define BHY2_SENSOR_ID_STC_WU                     UINT8_C(53) /* Step counter wake up */
#define BHY2_SENSOR_ID_SIG                        UINT8_C(55) /* Significant motion */
#define BHY2_SENSOR_ID_WAKE_GESTURE               UINT8_C(57) /* Wake gesture */
#define BHY2_SENSOR_ID_GLANCE_GESTURE             UINT8_C(59) /* Glance gesture */
#define BHY2_SENSOR_ID_PICKUP_GESTURE             UINT8_C(61) /* Pickup gesture */
#define BHY2_SENSOR_ID_AR                         UINT8_C(63) /* Activity recognition */
#define BHY2_SENSOR_ID_WRIST_TILT_GESTURE         UINT8_C(67) /* Wrist tilt gesture */
#define BHY2_SENSOR_ID_DEVICE_ORI                 UINT8_C(69) /* Device orientation */
#define BHY2_SENSOR_ID_DEVICE_ORI_WU              UINT8_C(70) /* Device orientation wake up */
#define BHY2_SENSOR_ID_STATIONARY_DET             UINT8_C(75) /* Stationary detect */
#define BHY2_SENSOR_ID_MOTION_DET                 UINT8_C(77) /* Motion detect */
#define BHY2_SENSOR_ID_ACC_BIAS_WU                UINT8_C(91) /* Accelerometer offset wake up */
#define BHY2_SENSOR_ID_GYRO_BIAS_WU               UINT8_C(92) /* Gyroscope offset wake up */
#define BHY2_SENSOR_ID_MAG_BIAS_WU                UINT8_C(93) /* Magnetometer offset wake up */
#define BHY2_SENSOR_ID_STD_WU                     UINT8_C(94) /* Step detector wake up */
#define BHY2_SENSOR_ID_TEMP                       UINT8_C(128) /* Temperature */
#define BHY2_SENSOR_ID_BARO                       UINT8_C(129) /* Barometer */
#define BHY2_SENSOR_ID_HUM                        UINT8_C(130) /* Humidity */
#define BHY2_SENSOR_ID_GAS                        UINT8_C(131) /* Gas */
#define BHY2_SENSOR_ID_TEMP_WU                    UINT8_C(132) /* Temperature wake up */
#define BHY2_SENSOR_ID_BARO_WU                    UINT8_C(133) /* Barometer wake up */
#define BHY2_SENSOR_ID_HUM_WU                     UINT8_C(134) /* Humidity wake up */
#define BHY2_SENSOR_ID_GAS_WU                     UINT8_C(135) /* Gas wake up */
#define BHY2_SENSOR_ID_STC_LP                     UINT8_C(136) /* Step counter Low Power */
#define BHY2_SENSOR_ID_STD_LP                     UINT8_C(137) /* Step detector Low Power */
#define BHY2_SENSOR_ID_SIG_LP                     UINT8_C(138) /* Significant motion Low Power */
#define BHY2_SENSOR_ID_STC_LP_WU                  UINT8_C(139) /* Step counter Low Power wake up */
#define BHY2_SENSOR_ID_STD_LP_WU                  UINT8_C(140) /* Step detector Low Power wake up */
#define BHY2_SENSOR_ID_SIG_LP_WU                  UINT8_C(141) /* Significant motion Low Power wake up */
#define BHY2_SENSOR_ID_ANY_MOTION_LP              UINT8_C(142) /* Any motion Low Power */
#define BHY2_SENSOR_ID_ANY_MOTION_LP_WU           UINT8_C(143) /* Any motion Low Power wake up */
#define BHY2_SENSOR_ID_EXCAMERA                   UINT8_C(144) /* External camera trigger */
#define BHY2_SENSOR_ID_GPS                        UINT8_C(145) /* GPS */
#define BHY2_SENSOR_ID_LIGHT                      UINT8_C(146) /* Light */
#define BHY2_SENSOR_ID_PROX                       UINT8_C(147) /* Proximity */
#define BHY2_SENSOR_ID_LIGHT_WU                   UINT8_C(148) /* Light wake up */
#define BHY2_SENSOR_ID_PROX_WU                    UINT8_C(149) /* Proximity wake up */

/*! Physical sensor IDs*/
#define BHY2_PHYS_SENSOR_ID_ACCELEROMETER         UINT8_C(1)
#define BHY2_PHYS_SENSOR_ID_GYROSCOPE             UINT8_C(3)
#define BHY2_PHYS_SENSOR_ID_MAGNETOMETER          UINT8_C(5)
#define BHY2_PHYS_SENSOR_ID_TEMP_GYRO             UINT8_C(7)
#define BHY2_PHYS_SENSOR_ID_ANY_MOTION            UINT8_C(9)
#define BHY2_PHYS_SENSOR_ID_PRESSURE              UINT8_C(11)
#define BHY2_PHYS_SENSOR_ID_POSITION              UINT8_C(13)
#define BHY2_PHYS_SENSOR_ID_HUMIDITY              UINT8_C(15)
#define BHY2_PHYS_SENSOR_ID_TEMPERATURE           UINT8_C(17)
#define BHY2_PHYS_SENSOR_ID_GAS_RESISTOR          UINT8_C(19)
#define BHY2_PHYS_SENSOR_ID_PHYS_STEP_COUNTER     UINT8_C(32)
#define BHY2_PHYS_SENSOR_ID_PHYS_STEP_DETECTOR    UINT8_C(33)
#define BHY2_PHYS_SENSOR_ID_PHYS_SIGN_MOTION      UINT8_C(34)
#define BHY2_PHYS_SENSOR_ID_PHYS_ANY_MOTION       UINT8_C(35)
#define BHY2_PHYS_SENSOR_ID_EX_CAMERA_INPUT       UINT8_C(36)
#define BHY2_PHYS_SENSOR_ID_GPS                   UINT8_C(48)
#define BHY2_PHYS_SENSOR_ID_LIGHT                 UINT8_C(49)
#define BHY2_PHYS_SENSOR_ID_PROXIMITY             UINT8_C(50)
#define BHY2_PHYS_SENSOR_ID_PHYS_NO_MOTION        UINT8_C(55)
#define BHY2_PHYS_SENSOR_ID_WRIST_GESTURE_DETECT  UINT8_C(56)
#define BHY2_PHYS_SENSOR_ID_WRIST_WEAR_WAKEUP     UINT8_C(57)

/*! System data IDs */
#define BHY2_IS_SYS_ID(sid)                       ((sid) >= 224)

#define BHY2_SYS_ID_PADDING                       UINT8_C(0)
#define BHY2_SYS_ID_TS_SMALL_DELTA                UINT8_C(251)
#define BHY2_SYS_ID_TS_LARGE_DELTA                UINT8_C(252)
#define BHY2_SYS_ID_TS_FULL                       UINT8_C(253)
#define BHY2_SYS_ID_META_EVENT                    UINT8_C(254)
#define BHY2_SYS_ID_TS_SMALL_DELTA_WU             UINT8_C(245)
#define BHY2_SYS_ID_TS_LARGE_DELTA_WU             UINT8_C(246)
#define BHY2_SYS_ID_TS_FULL_WU                    UINT8_C(247)
#define BHY2_SYS_ID_META_EVENT_WU                 UINT8_C(248)
#define BHY2_SYS_ID_FILLER                        UINT8_C(255)
#define BHY2_SYS_ID_DEBUG_MSG                     UINT8_C(250)
#define BHY2_SYS_ID_BHY2_LOG_UPDATE_SUB           UINT8_C(243)
#define BHY2_SYS_ID_BHY2_LOG_DOSTEP               UINT8_C(244)

/*! Status code definitions */
#define BHY2_STATUS_INITIALIZED                   UINT8_C(0x1)
#define BHY2_STATUS_DEBUG_OUTPUT                  UINT8_C(0x2)
#define BHY2_STATUS_CRASH_DUMP                    UINT8_C(0x3)
#define BHY2_STATUS_INJECT_SENSOR_CONF_REQ        UINT8_C(0x4)
#define BHY2_STATUS_SW_PASS_THRU_RES              UINT8_C(0x5)
#define BHY2_STATUS_SELF_TEST_RES                 UINT8_C(0x6)
#define BHY2_STATUS_FOC_RES                       UINT8_C(0x7)
#define BHY2_STATUS_SYSTEM_ERROR                  UINT8_C(0x8)
#define BHY2_STATUS_SENSOR_ERROR                  UINT8_C(0x9)
#define BHY2_STATUS_FLASH_ERASE_COMPLETE          UINT8_C(0xA)
#define BHY2_STATUS_FLASH_WRITE_COMPLETE          UINT8_C(0xB)
#define BHY2_STATUS_FLASH_CONTINUE_UPLOAD         UINT8_C(0xC)
#define BHY2_STATUS_HOST_EV_TIMESTAMP             UINT8_C(0xD)
#define BHY2_STATUS_DUT_TEST_RES                  UINT8_C(0xE)
#define BHY2_STATUS_CMD_ERR                       UINT8_C(0xF)

#define BHY2_IS_STATUS_GET_PARAM_OUTPUT(status)   ((status) >= 0x100 && (status) <= 0xFFF)

