Dmivaka/STM32-HAL-BHI360/bosch/bhy2_defs.h
/*! Activity bits */
#define BHY2_STILL_ACTIVITY_ENDED                 (0x0001)
#define BHY2_WALKING_ACTIVITY_ENDED               (0x0002)
#define BHY2_RUNNING_ACTIVITY_ENDED               (0x0004)
#define BHY2_ON_BICYCLE_ACTIVITY_ENDED            (0x0008)
#define BHY2_IN_VEHICLE_ACTIVITY_ENDED            (0x0010)
#define BHY2_TILTING_ACTIVITY_ENDED               (0x0020)

#define BHY2_STILL_ACTIVITY_STARTED               (0x0100)
#define BHY2_WALKING_ACTIVITY_STARTED             (0x0200)
#define BHY2_RUNNING_ACTIVITY_STARTED             (0x0400)
#define BHY2_ON_BICYCLE_ACTIVITY_STARTED          (0x0800)
#define BHY2_IN_VEHICLE_ACTIVITY_STARTED          (0x1000)
#define BHY2_TILTING_ACTIVITY_STARTED             (0x2000)

/*! Feature status */
#define BHY2_FEAT_STATUS_FLASH_DESC_MSK           UINT8_C(0x01)
#define BHY2_FEAT_STATUS_OPEN_RTOS_MSK            UINT8_C(0x02)
#define BHY2_FEAT_STATUS_OPEN_RTOS_POS            (1)
#define BHY2_FEAT_STATUS_HOST_ID_MSK              UINT8_C(0x1C)
#define BHY2_FEAT_STATUS_HOST_ID_POS              (2)
#define BHY2_FEAT_STATUS_ALGO_ID_MSK              UINT8_C(0xE0)
#define BHY2_FEAT_STATUS_ALGO_ID_POS              (5)

/*! Fast offset compensation status codes */
#define BHY2_FOC_PASS                             UINT8_C(0x00)
#define BHY2_FOC_FAILED                           UINT8_C(0x65)
#define BHY2_FOC_UNKNOWN_FAILURE                  UINT8_C(0x23)

/*! Self test status codes */
#define BHY2_ST_PASSED                            UINT8_C(0x00)
#define BHY2_ST_X_AXIS_FAILED                     UINT8_C(0x01)
#define BHY2_ST_Y_AXIS_FAILED                     UINT8_C(0x02)
#define BHY2_ST_Z_AXIS_FAILED                     UINT8_C(0x04)
#define BHY2_ST_MULTI_AXIS_FAILURE                UINT8_C(0x07)
#define BHY2_ST_NOT_SUPPORTED                     UINT8_C(0x08)
#define BHY2_ST_INVALID_PHYS_ID                   UINT8_C(0x09)

#define BHY2_LE2U16(x)                            ((uint16_t)((x)[0] | (x)[1] << 8))
#define BHY2_LE2S16(x)                            ((int16_t)BHY2_LE2U16(x))
#define BHY2_LE2U24(x)                            ((uint32_t)((x)[0] | (uint32_t)(x)[1] << 8 | (uint32_t)(x)[2] << 16))
#define BHY2_LE2S24(x)                            ((int32_t)(BHY2_LE2U24(x) << 8) >> 8)
#define BHY2_LE2U32(x)                            ((uint32_t)((x)[0] | (uint32_t)(x)[1] << 8 | (uint32_t)(x)[2] << 16 | \
                                                              (uint32_t)(x)[3] << 24))
#define BHY2_LE2S32(x)                            ((int32_t)BHY2_LE2U32(x))
#define BHY2_LE2U40(x)                            (BHY2_LE2U32(x) | (uint64_t)(x)[4] << 32)
#define BHY2_LE2U64(x)                            (BHY2_LE2U32(x) | (uint64_t)BHY2_LE2U32(&(x)[4]) << 32)

#define BHY2_LE24MUL(x)                           (((x) % 4) ? (uint16_t)((((x) / 4) + 1) * 4) : (uint16_t)((x) + 4))

/*! Maximum no of available virtual sensor */
#define BHY2_N_VIRTUAL_SENSOR_MAX                 UINT8_C(256)

#ifndef BHY2_MAX_SIMUL_SENSORS
#define BHY2_MAX_SIMUL_SENSORS                    48
#endif

/* Special & debug virtual sensor id starts at 245 */
#define BHY2_SPECIAL_SENSOR_ID_OFFSET             UINT8_C(245)

#ifndef BHY2_INTF_RET_TYPE
#define BHY2_INTF_RET_TYPE                        int8_t
#endif

#ifndef BHY2_INTF_RET_SUCCESS
#define BHY2_INTF_RET_SUCCESS                     0
#endif

/* Type definitions for the function pointers */
typedef BHY2_INTF_RET_TYPE (*bhy2_read_fptr_t)(uint8_t reg_addr, uint8_t *reg_data, uint32_t length, void *intf_ptr);
typedef BHY2_INTF_RET_TYPE (*bhy2_write_fptr_t)(uint8_t reg_addr, const uint8_t *reg_data, uint32_t length,
                                                void *intf_ptr);
typedef void (*bhy2_delay_us_fptr_t)(uint32_t period_us, void *intf_ptr);

enum bhy2_intf {
    BHY2_SPI_INTERFACE = 1,
    BHY2_I2C_INTERFACE
};

/* HIF device structure */
struct bhy2_hif_dev
{
    bhy2_read_fptr_t read;
    bhy2_write_fptr_t write;
    bhy2_delay_us_fptr_t delay_us;
    enum bhy2_intf intf;
    void *intf_ptr;
    BHY2_INTF_RET_TYPE intf_rslt;
    uint32_t read_write_len;
};

enum bhy2_fifo_type {
    BHY2_FIFO_TYPE_WAKEUP,
    BHY2_FIFO_TYPE_NON_WAKEUP,
    BHY2_FIFO_TYPE_STATUS,
    BHY2_FIFO_TYPE_MAX
};

struct BHY2_PACKED bhy2_fifo_parse_data_info
{
    uint8_t sensor_id;
    enum bhy2_fifo_type fifo_type;
    uint8_t data_size;
    uint8_t *data_ptr;
    uint64_t *time_stamp;
};

typedef void (*bhy2_fifo_parse_callback_t)(const struct bhy2_fifo_parse_data_info *callback_info, void *private_data);

struct BHY2_PACKED bhy2_fifo_parse_callback_table
{
    uint8_t sensor_id;
    bhy2_fifo_parse_callback_t callback;
    void *callback_ref;
};

/* Device structure */
struct bhy2_dev
{
    struct bhy2_hif_dev hif;
    struct bhy2_fifo_parse_callback_table table[BHY2_MAX_SIMUL_SENSORS];
    uint8_t event_size[BHY2_N_VIRTUAL_SENSOR_MAX];
    uint64_t last_time_stamp[BHY2_FIFO_TYPE_MAX];
    uint8_t present_buff[32];
};

struct bhy2_fifo_buffer
{
    uint32_t read_pos;
    uint32_t read_length;
    uint32_t remain_length;
    uint32_t buffer_size;
    uint8_t *buffer;
};

typedef int16_t (*bhy2_frame_parse_func_t)(struct bhy2_fifo_buffer *p_fifo_buffer, struct bhy2_dev *bhy2_p);

struct bhy2_virt_sensor_conf
{
    uint16_t sensitivity;
    uint16_t range;
    uint32_t latency;
    bhy2_float sample_rate;
};

struct bhy2_data_xyz
{
    int16_t x;
    int16_t y;
    int16_t z;
};

struct bhy2_data_quaternion
{
    int16_t x;
    int16_t y;
    int16_t z;
    int16_t w;
    uint16_t accuracy;
};

struct bhy2_data_orientation
{
    int16_t heading;
    int16_t pitch;
    int16_t roll;
};

union BHY2_PACKED bhy2_spt_dev_id
{
    uint8_t slave_address;
    uint8_t cs_pin;
};

struct BHY2_PACKED bhy2_spt_bits
{
    /*! byte 1 */
    uint8_t direction : 1; /**< 0: read; 1: write. */
    uint8_t trans_type : 1; /**< 0: single burst; 1:multi single transfers. */
    uint8_t delay_ctrl : 1; /**< 0: none; 1: delay between bytes. */
    uint8_t master_bus : 2; /**< 1: SIF1; 2: SIF2; 3:SIF3. */
    uint8_t spi_mode : 1; /**< 0: 4 wire; 1: 3 wire. */
    uint8_t cpol : 1; /**< spi clock polarity. */
    uint8_t cpha : 1; /**< spi clock phase. */
    /*! byte 2 */
    uint8_t delay_val : 6; /**< multiples of 50us. min is 200us (4LSB) */
    uint8_t cs_level : 1; /**< chip select level. */
    uint8_t lsb_first : 1; /**< least significant byte first. */
    /*! byte 3~4 */
    uint16_t trans_rate; /**< spi clock rate. */
    /*! byte 5 */
    uint8_t address_shift : 4; /**< number of bits to shift register address. */
    uint8_t read_bit_pol : 1; /**< 0: active low; 1: active high. */
    uint8_t read_bit_pos : 3; /**< bit number of read bit in command byte. */
    /*! byte 6 */
    union bhy2_spt_dev_id func_set;

    /*! byte 7 */
    uint8_t trans_count;

    /*! byte 8 */
    uint8_t reg;
};

union bhy2_soft_passthrough_conf
{
    struct bhy2_spt_bits conf;
    uint8_t data[8];
};

union bhy2_u16_conv
{
    uint16_t u16_val;
    uint8_t bytes[2];
};
union bhy2_u32_conv
{
    uint32_t u32_val;
    uint8_t bytes[4];
};
union bhy2_float_conv
{
    bhy2_float f_val;
    uint32_t u32_val;
    uint8_t bytes[4];
};
struct bhy2_sensor_info
{
    uint8_t sensor_type;
    uint8_t driver_id;
    uint8_t driver_version;
    uint8_t power;
    union bhy2_u16_conv max_range;
    union bhy2_u16_conv resolution;
    union bhy2_float_conv max_rate;
    union bhy2_u32_conv fifo_reserved;
    union bhy2_u32_conv fifo_max;
    uint8_t event_size;
    union bhy2_float_conv min_rate;
};

struct bhy2_phys_sensor_info
{
    uint8_t sensor_type;
    uint8_t driver_id;
    uint8_t driver_version;
    uint8_t power_current;
    union bhy2_u16_conv curr_range;
    uint8_t flags;
    uint8_t slave_address;
    uint8_t gpio_assignment;
    union bhy2_float_conv curr_rate;
    uint8_t num_axis;
    uint8_t orientation_matrix[5];
    uint8_t reserved;
};

struct bhy2_self_test_resp
{
    uint8_t test_status;
    int16_t x_offset, y_offset, z_offset;
};

struct bhy2_foc_resp
{
    uint8_t foc_status;
    int16_t x_offset, y_offset, z_offset;
};

struct bhy2_orient_matrix
{
    int8_t c[9];
};

enum bhy2_data_inj_mode {
    BHY2_NORMAL_MODE = 0,
    BHY2_REAL_TIME_INJECTION = 1,
    BHY2_STEP_BY_STEP_INJECTION = 2
};

#define BHY2_BYTE_TO_NIBBLE(X)  (((uint8_t)(X)[0] & 0x0F) | (((uint8_t)(X)[1] << 4) & 0xF0))

/* End of CPP Guard */
#ifdef __cplusplus
}
#endif /*__cplusplus */

#endif /* __BHY2_DEFS_H__ */
